html/posts/RAN-concept.html
<!DOCTYPE html>
<html>
<head>
<!-- 2020-09-02 Wed 14:49 -->
<meta charset="utf-8">
<title>Radio Access Network (RAN)</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Quan Vu">
<meta name="twitter:site" content="@null" />
<meta name="twitter:creator" content="@null" />
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
<link rel="icon" type="image/png" href="https://vhquan.github.io/.images/icon/favicon-32x32.png" />
<link rel="apple-touch-icon-precomposed" href="https://vhquan.github.io/.images/icon/apple-touch-icon.png" />
<link rel="stylesheet" type="text/css" href="https://vhquan.github.io/.css/font.css">
<link rel="stylesheet" type="text/css" href="https://vhquan.github.io/.css/main.css">
</head>
<body>
<div id="wrapper">
<div id="preamble" class="status">
<h1 class="title"><a href="https://vhquan.github.io">Quan Vu's Blog</a></h1>

<nav>
  <div class="navitem"><a href="https://vhquan.github.io">About</a></div>
  <div class="navitem"><a href="https://vhquan.github.io/html/posts/index.html">Blog</a></div>
  <div class="navitem"><a href="https://vhquan.github.io/html/portfolio/portfolio.html">Portfolio</a></div>
  <div class="navitem"><a href="https://vhquan.github.io/html/contact/contact.html">Contact</a></div>
  <div class="navitem"><a href="https://vhquan.github.io/html/resume/resume.html">R&eacute;sum&eacute;</a></div>
</nav>
</div>
<div id="content">
<header>
<h1 class="title">Radio Access Network (RAN)</h1>
</header><p>
<b>A radio access network (RAN) is part of a mobile telecommunication system. It implements a radio access technology. Conceptually, it resides between a device such as a mobile phone, a computer, or any remotely controlled machine and provides connection with its core network (CN)</b>
</p>
<div class="more">

</div>

<p>
Depending on the standard, mobile phones and other wireless connected devices are varyingly known as user equipment (UE), teminal equipment, mobile station (MS), etc. RAN functionality is typically provided by a silicon chip residing in both the core network as well as the user equipment. See the following diagram:
</p>

<pre class="example">
     CN
    /  \
   /    \
 RAN    RAN
 / \    / \
UE UE  UE UE
</pre>
<p>
Examples of radio access network types are:
</p>

<ul class="org-ul">
<li>GRAN: GSM radio access network.</li>
<li>GERAN: essentially the same as GRAN but specifying the inclusion of EDGE packet radio services.</li>
<li>UTRAN: UMTS radio access network.</li>
<li>E-UTRAN: The Long-Term Evolution (LTE) high speed and how latency radio access network.</li>
</ul>

<p>
It is also possible for a single handset/phone to be simultaneously connected to multiple radio access networks. Handsets capable of this are sometimes called dual-mode handsets. For instance it is common for handsets to support both GSM and UMTS (a.k.a "3G") radio access technologies. Such devices seamlessly transfer an ongoing call between different radio access network without the user noticing any disruption in service.
</p>
</div>
<div id="postamble" class="status">
<div id="footer">
<p>Proudly with <a href="https://www.gnu.org/software/emacs/">Emacs</a> and <a href="https://orgmode.org/">Org Mode</a>.</div>
</div>
</div>
</body>
</html>
